Revit 2027 API
ScheduleDefinition.RemoveFilter Method
 Removes a filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveFilter(
	int index
)
Public Sub RemoveFilter (
	index As Integer
)
public:
void RemoveFilter(
	int index
)
member RemoveFilter :
        index : int -> unit
Parameters
index Int32
 The index of the filter to remove.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  index is not a valid filter index.
InvalidOperationException |  This ScheduleDefinition does not support filters.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace